def first_count(i, l):
    u = 0
    if i > l:
        while i != l:
            u = u + i
            i = i - 1
        u = u + l
        print(u)

def second_count(i, l):
    u = 0
    if i < l:
        while l != i:
            u = u + l
            l = l - 1
        u = u + i
        print(u)

def comfort_days_may_2020():
    comfort_days = 0
    for days in may_2020:
        if 22 <= int(days) <= 26 :
            comfort_days+=1
    print ('Количество комфортных дней в мае месяце 2020 года:', comfort_days)
def comfort_days_may_2021():
    comfort_days2 = 0
    for days in may_2021:
        if 22 <= int(days) <= 26 :
            comfort_days2+=1
    print ('Количество комфортных дней в мае месяце 2021 года:', comfort_days2)
# ----------------------------------------------------------------------------------------------------------------

# i = int(input('Введите первое число больше 0: '))
# l = int(input('Введите второе число больше 0: '))
#
# first_count(i, l)
# second_count(i, l)

may_2020 = [24, 26, 15, 10, 15, 19, 10, 1, 4, 7, 7, 7, 12, 14, 17, 8, 9, 19, 21, 22, 11, 15, 19, 23, 15, 21, 16, 13, 25, 17, 19]
may_2021 = [20, 27, 23, 18, 24, 16, 20, 24, 18, 15, 19, 25, 24, 26, 19, 24, 25, 21, 17, 11, 20, 21, 22, 23, 18, 20, 23, 18, 22, 23, 11]

comfort_days_may_2020()
comfort_days_may_2021()
# ----------------------------------------------------------------------------------------------------------------
