# Типы данных

'''Список'''
a_list = [] # пустой список
b_list = ['string', 1, 1.5, 1 + 4, a_list] # что может быть в списке
print(b_list)

'''Строка'''
a = 'строка1'
b = 'string2'
c = '!@#$%^&*()_{"LLJGYIFYUJN4515'
print(a, b, c)

'''Целое число'''
ch_1 = 1
ch_2 = 1674
print(ch_1, ch_2)

'''Дробное число'''
d_ch_1 = 1.5
d_ch_2 = 10.498866
print(d_ch_1, d_ch_2)

'''Логический тип'''
l_1 = True
l_2 = False

'''Кортеж (tuple)'''
# НЕ изменяется
# Добавлять, удалять, перемешивать
k = (1, 'str', 1.5)
k_2 = 123, 567, 345, 230